# Напишите программу для печати всех уникальных
# значений в словаре.
# Input: [{"V": "S001"}, {"V": "S002"}, {"VI": "S001"},
# {"VI": "S005"}, {"VII": " S005 "}, {" V ":" S009 "}, {" VIII
# ":" S007 "}]
# Output: {'S005', 'S002', 'S007', 'S001', 'S009'}

# Иструкция по работе со словарем 
# my_dict = {
#     142342: 'Стол',
#     534534: 'Диван',
#     142342: {
#         'name': 'Кресло',
#         'count': 10,
#         'color': 'Зеленое',
#         'info': [1, 4, 2]
#     }
# }
# print(my_dict[142342]['info'][-1])
# for key, val in my_dict.items():
#     print(key, '---', val)
data = [
    {"V": "S001"},
    {"V": "S002"},
    {"VI": "S001"},
    {"VI": "S005"},
    {"VII": "S005"},
    {"V": "S009"},
    {"VIII": "S007"}
]

# Создадим пустой список для хранения уникальных значений
unique_values = []

# Пройдемся по каждому элементу в списке словарей
for item in data:
    # Пройдемся по значениям в словаре
    for value in item.values():
        value = value.strip()  # Удалим лишние пробелы
        if value not in unique_values:  # Проверим, есть ли значение в списке
            unique_values.append(value)  # Если нет, добавим его

# Выведем уникальные значения
print(unique_values)

    
    





